In [2]:
import pandas as pd
from IPython.display import display, Markdown

# Loading data
calendar_df = pd.read_csv("calendar_data.csv")
client_df = pd.read_csv("client_data.csv")
deposit_df = pd.read_csv("deposit_data.csv")

# Sampling data
calendar_sample = calendar_df.sample(n=5, random_state=42)
client_sample = client_df.sample(n=5, random_state=42)
deposit_sample = deposit_df.sample(n=5, random_state=42)

# Displaying samples
display(Markdown("### Calendar Data Sample"))
display(calendar_sample)

display(Markdown("### Client Data Sample"))
display(client_sample)

display(Markdown("### Deposit Data Sample"))
display(deposit_sample)

### Calendar Data Sample

    gregorian_date month_name
84      2019-08-24    Month 3
86      2019-08-26    Month 3
97      2019-09-06    Month 4
115     2019-09-24    Month 4
29      2019-06-30    Month 1

### Client Data Sample

,client_id,client_geographical_region,client_residence_status,client_age
6065,686872246977897,West,Own,35
28070,470518677565299,South,Rent,56
6936,883739117234218,South,Own,36
23158,822713875250308,South,Own,52
25506,442404955135328,South,Rent,53

### Deposit Data Sample

,client_id,deposit_type,deposit_amount,deposit_cadence,deposit_date
229803,903285839400111,Scheduled Deposit,458.0,Monthly,2019-08-16
92181,19473282206850,Scheduled Deposit,334.0,Monthly,2019-10-08
284306,240342552445691,Actual Deposit,500.0,Biweekly,2019-10-14
117592,503016878166122,Scheduled Deposit,30.0,Biweekly,2019-07-03
453913,774929593989542,Scheduled Deposit,476.0,Monthly,2019-09-30

In [4]:
calendar_df['gregorian_date'] = pd.to_datetime(calendar_df['gregorian_date'])
deposit_df['deposit_date'] = pd.to_datetime(deposit_df['deposit_date'])
main_df = pd.merge(left=client_df, right=deposit_df, on="client_id", how= "inner")
main_df = pd.merge(left=main_df, right=calendar_df, left_on="deposit_date", right_on="gregorian_date", how= "inner")
main_df.drop(columns="gregorian_date", inplace=True)
main_df.sample(n=10, random_state=42)

,client_id,client_geographical_region,client_residence_status,client_age,deposit_type,deposit_amount,deposit_cadence,deposit_date,month_name
229803,118418867104868,West,Own,56,Scheduled Deposit,240.0,Monthly,2019-09-15,Month 4
92181,191569209118275,West,Own,40,Actual Deposit,2046.0,Monthly,2019-08-22,Month 3
284306,45082134288198,West,Rent,46,Actual Deposit,150.0,Biweekly,2019-07-26,Month 2
117592,180858736543465,West,Own,74,Actual Deposit,598.0,Monthly,2019-07-07,Month 2
453913,411360469164409,West,Rent,40,Actual Deposit,298.0,Biweekly,2019-10-13,Month 5
427363,521434988306466,Northeast,Own,78,Scheduled Deposit,304.0,Monthly,2019-10-30,Month 5
90436,377733278118703,West,Own,43,Actual Deposit,166.0,Biweekly,2019-08-07,Month 3
391277,330910093231962,Midwest,Rent,60,Scheduled Deposit,274.0,Monthly,2019-06-19,Month 1
417793,55253177121961,Northeast,Own,63,Actual Deposit,258.0,Monthly,2019-06-20,Month 1
454206,440652444240597,Northeast,Own,42,Scheduled Deposit,432.0,Monthly,2019-10-13,Month 5

In [32]:
monthly_sum = main_df.groupby(by="month_name")["deposit_amount"].sum()
monthly_cnt = main_df.groupby(by="month_name")["deposit_amount"].count()

print("Monthly Sum of Deposit Amounts:")
print(monthly_sum)
# print("\nAverage Deposit Amount per Month:")
# print(monthly_sum/monthly_cnt)

Monthly Sum of Deposit Amounts:
month_name
Month 1    29284830.86
Month 2    29886431.27
Month 3    39675057.10
Month 4    38515819.73
Month 5    38081175.23
Name: deposit_amount, dtype: float64

In [33]:
monthly_sum_reg = main_df.groupby(by=["client_geographical_region", "month_name"])["deposit_amount"].sum()
monthly_cnt_reg = main_df.groupby(by=["client_geographical_region", "month_name"])["deposit_amount"].count()

print("Monthly Sum of Deposit Amounts:")
print(monthly_sum_reg)
# print("\nAverage Deposit Amount per Month:")
# print(monthly_sum/monthly_cnt)

Monthly Sum of Deposit Amounts:
client_geographical_region  month_name
Midwest                     Month 1        5430601.52
                            Month 2        5499689.53
                            Month 3        7229628.36
                            Month 4        7176212.72
                            Month 5        7069993.34
Northeast                   Month 1        4445002.60
                            Month 2        4629536.48
                            Month 3        6284626.55
                            Month 4        6068852.58
                            Month 5        5996444.67
South                       Month 1        6889359.44
                            Month 2        6946975.38
                            Month 3        8975639.94
                            Month 4        8714428.55
                            Month 5        8623703.15
West                        Month 1       12519867.30
                            Month 2       12810229.88
                            Month 3       17185162.25
                            Month 4       16556325.88
                            Month 5       16391034.07
Name: deposit_amount, dtype: float64

In [34]:
monthly_df = monthly_sum.reset_index()
monthly_df

  month_name  deposit_amount
0    Month 1     29284830.86
1    Month 2     29886431.27
2    Month 3     39675057.10
3    Month 4     38515819.73
4    Month 5     38081175.23

  month_name  deposit_amount  diff_from_Mon3
0    Month 1     29284830.86       73.811692
1    Month 2     29886431.27       75.328011
2    Month 3     39675057.10      100.000000
3    Month 4     38515819.73       97.078171
4    Month 5     38081175.23       95.982660